README.md
```mermaid
classDiagram
    class Recurso {
        <<abstract>>
        #nombre : string
        +ejecutarAccion()* void
        +mostrarInfo() void
        +getNombre() string
    }
    class Vehiculo {
        <<abstract>>
        #placa : string
        #capacidad : int
        +mostrarInfo() void
    }
    class Personal {
        <<abstract>>
        #especialidad : string
        +mostrarInfo() void
    }
    class Ambulancia {
        +ejecutarAccion() void
        +mostrarInfo() void
    }
    class Helicoptero {
        +ejecutarAccion() void
        +mostrarInfo() void
    }
    class Medico {
        +ejecutarAccion() void
        +mostrarInfo() void
    }
    class Rescatista {
        +ejecutarAccion() void
        +mostrarInfo() void
    }
    class Mision {
        -id : int
        -descripcion : string
        -zona : string
        -recursosAsignados : Recurso**
        -cantidadRecursos : int
        -capacidadRecursos : int
        +asignarRecurso(Recurso*) void
        +tieneRecurso(const Recurso*) bool
        +ejecutar() void
        +mostrarInfo() void
        +getDescripcion() string
        -redimensionar() void
    }
    class Controlador {
        -listaRecursos : Recurso**
        -cantidadRecursos : int
        -capacidadRecursos : int
        -listaMisiones : Mision**
        -cantidadMisiones : int
        -capacidadMisiones : int
        +iniciar() void
        -verRecursos() void
        -registrarRecurso() void
        -crearMision() void
        -asignarRecursoAMision() void
        -ejecutarMision() void
        -mostrarMenu() void
        -mostrarMisiones() void
        -agregarRecurso(Recurso*) void
        -agregarMision(Mision*) void
        -cargarDatosPrueba() void
        -leerEnteroEnRango(string, int, int, int) bool
        -leerTexto(string, string) bool
    }
    Recurso <|-- Vehiculo
    Recurso <|-- Personal
    Vehiculo <|-- Ambulancia
    Vehiculo <|-- Helicoptero
    Personal <|-- Medico
    Personal <|-- Rescatista
    Controlador "1" *-- "0..*" Recurso : gestiona
    Controlador "1" *-- "0..*" Mision : administra
    Mision "0..*" o-- "0..*" Recurso : agrega
```
